{
  "version": "1.0.0",
  "name": "Mörk Borg Core Classes",
  "classes": [
    {
      "id": "classless",
      "name": "Classless",
      "description": "A wretched soul with no special training",
      "abilityRolls": {
        "strength": "3d6",
        "agility": "3d6",
        "presence": "3d6",
        "toughness": "3d6"
      },
      "hitDie": "d8",
      "startingOmens": "d2",
      "startingSilver": "2d6*10",
      "specialAbilities": []
    },
    {
      "id": "fanged-deserter",
      "name": "Fanged Deserter",
      "description": "You have thirty or so friends who never let you down: YOUR TEETH. Disloyal, deranged or simply uncontrollable, any group that didn't boot you out you left anyway. But your parliament of teeth—enormous, protruding, thick and sharp—have always been your allies.",
      "abilityRolls": {
        "strength": "3d6+2",
        "agility": "3d6-1",
        "presence": "3d6-1",
        "toughness": "3d6"
      },
      "hitDie": "d10",
      "startingOmens": "d2",
      "startingSilver": "2d6*10",
      "specialAbilities": [
        {
          "name": "Crumpled Monster Mask",
          "description": "Strikes primitive fear into lesser creatures like goblins, gnoums and children. While worn, they check Morale every round."
        },
        {
          "name": "The Brown Scimitar of Galgenbeck",
          "description": "A stinking sword you pulled from a military shit-ditch. D6 damage. DR10 attack and defence while you wield it. 1 in 6 chance a wounded enemy is smitten with potent sepsis, dying in 10 minutes."
        },
        {
          "name": "Wizard Teeth",
          "description": "Four weird teeth rattle within a blackened pouch. Before battle roll a d6 for each one. For every 6 one of your attacks deals maximum damage."
        },
        {
          "name": "Old Sigûrd's Sling",
          "description": "Sigûrd was the strongest man whose throat you ever gnawed. Woven from his long grey hair, this sling has never failed you. 2d4 damage, requires fist-sized rocks which, perhaps regrettably, are everywhere."
        },
        {
          "name": "Ancient Gore-Hound",
          "description": "Asthmatic, deluded and on its last legs, this wizened creature still has a superb nose and can sniffle up treasure in the most disgusting debris. Attacks with DR10 (bite d6). Defends with DR12, 10 hp. Becomes frenzied around goblins and berserkers."
        },
        {
          "name": "The Shoe of Death's Horse",
          "description": "It looks normal but since finding it in an obscure crypt you are convinced this shoe came from the horse of Death himself. In your hands it hits with DR10, d4 damage. 1 in 6 chance the shoe smashes the skull, instantly killing small-to-medium sized creatures. The shoe returns to your hand like a boomerang."
        }
      ],
      "passiveAbilities": [
        {
          "name": "Bite Attack",
          "description": "DR10 to attack, d6 damage. You must be close to your target. 1-2 on d6 chance the enemy gets a free attack."
        }
      ],
      "limitations": ["Illiterate", "Normal Agility tests are DR14 instead of DR12 (excluding defence)"]
    },
    {
      "id": "gutterborn-scum",
      "name": "Gutterborn Scum",
      "description": "An ill star smiled upon your birth. Poverty, crime and bad parenting didn't help either. In your community an honest day's work was never an option. Not that you ever tried, what are you, some kind of mug? A razor blade and a moonless night are worth a week of chump-work.",
      "abilityRolls": {
        "strength": "3d6-2",
        "agility": "3d6",
        "presence": "3d6",
        "toughness": "3d6"
      },
      "hitDie": "d6",
      "startingOmens": "d2",
      "startingSilver": "1d6*10",
      "specialAbilities": [
        {
          "name": "Coward's Jab",
          "description": "When attacking by surprise test Agility DR10. On a success you automatically hit once with a light one-handed weapon, dealing normal damage +3."
        },
        {
          "name": "Filthy Fingersmith",
          "description": "Your snaky little digits get into pockets and pick locks with a DR8 Agility test. You also begin with lockpicks!"
        },
        {
          "name": "Abominable Gob Lobber",
          "description": "Your phlegm is viscous, lumpy, vile and ballistically accurate at short range. You can spit d2 times during a fight. Roll a DR8 Presence test for accuracy. Targets are blinded, retching and vomiting for d4 rounds. Anyone witnessing this—friend and foe—must make a Toughness test to not also vomit. PCs test DR10 and enemies DR12."
        },
        {
          "name": "Escaping Fate",
          "description": "Every time you use an omen there is a 50% chance it is not spent."
        },
        {
          "name": "Excretal Stealth",
          "description": "You have an astounding, almost preternatural ability to hide in muck, debris and filth. When hidden in these conditions a DR16 Presence test is required to notice you."
        },
        {
          "name": "Dodging Death",
          "description": "You are so unpleasant, irrelevant, disgusting and vile even Death would rather avoid you if it can. On death, if there is even the slightest possibility that you survived, there is a 50% chance that you did. If successful, after 10 rounds you pop back up with d4 hp and an unlikely explanation of your escape."
        }
      ],
      "passiveAbilities": [
        {
          "name": "Stealthy",
          "description": "All Presence and Agility tests have their DR reduced by 2 (normal tests are DR10 instead of DR12)."
        }
      ],
      "limitations": ["Small: -2 Strength already applied"]
    },
    {
      "id": "esoteric-hermit",
      "name": "Esoteric Hermit",
      "description": "The stone of your cave is one with the stars. Silence and perfection. Now the chaos of a fallen world disturbs your rituals and the caul of night grows blacker than your cavern's gloom. Irritating!",
      "abilityRolls": {
        "strength": "3d6-2",
        "agility": "3d6",
        "presence": "3d6+2",
        "toughness": "3d6"
      },
      "hitDie": "d4",
      "startingOmens": "d4",
      "startingSilver": "1d6*10",
      "specialAbilities": [
        {
          "name": "Master of Fate",
          "description": "What use are maps when the substance of causality itself is open to you? You know the right way with a DR8 Presence test."
        },
        {
          "name": "Book of Boiling Blood",
          "description": "You may open and read from this book once a day. Your enemy must make a DR12 test to prevent this. If they fail D2 Berserker-slayers appear from the depths of a forgotten dimension of blood. Roll a D6. On a 1–4 these creatures fight alongside you. On a 5–6 they turn on you, attempting to kill you and destroy the book. After the battle they return to their imprisonment."
        },
        {
          "name": "Speaker of Truths",
          "description": "Twice per day use your wisdom, knowledge, advice and inner calm to bring clarity to a creature of your choice. The DR of the next test they undertake is lowered by 4."
        },
        {
          "name": "Initiate of the Invisible College",
          "description": "Once per day you may summon D2 scrolls, whose power can be used only once. Roll a d4, on a 1–2 the scrolls are sacred, on a 3–4, unclean. If the scrolls are not used before sunrise they turn to ash."
        },
        {
          "name": "Bard of the Undying",
          "description": "You learnt your melodies in the Otherworld. The music of your Harp gives +D4 on reaction rolls."
        },
        {
          "name": "Hawk as Weapon",
          "description": "Your crafty almost-intelligent hawk is loyal only to you. Even without shared language, you understand its cries as it keeps watch, scouts and swoops to attack foes. Attacks/defence DR10 (claws/bite D4) HP 8."
        }
      ],
      "passiveAbilities": [
        {
          "name": "Scroll User",
          "description": "Ordinary starting equipment plus one random scroll (sacred or unclean)."
        }
      ],
      "limitations": ["Weak: -2 Strength already applied"]
    },
    {
      "id": "wretched-royalty",
      "name": "Wretched Royalty",
      "description": "Bowed down only by the memories of your own lost glory, you could never submit to anyone else. Not you, of noble blood! (Not that you expect these peons to understand the depths of your sorrow.)",
      "abilityRolls": {
        "strength": "3d6",
        "agility": "3d6",
        "presence": "3d6",
        "toughness": "3d6"
      },
      "hitDie": "d6",
      "startingOmens": "d2",
      "startingSilver": "4d6*10",
      "specialAbilities": [
        {
          "name": "The Blade of Your Ancestors",
          "description": "This magnificent and clearly magical talking sword is foppish, unreliable and quietly despises you. It taunts your failures and, if continually disappointed, develops a 1 in 6 chance to 'accidentally' attack you or your companions. Deals d6+1 damage. Attack/Defence DR is 10."
        },
        {
          "name": "'Poltroon' the Court Jester",
          "description": "While practically useless, personally irritating and an emotional drain, Poltroon's capering actually makes enemies lose their focus in combat. For the first two rounds you and your allies get +2 on attack/defence."
        },
        {
          "name": "Barbarister the Incredible Horse",
          "description": "Barbarister is magical, intelligent, arrogant and vain. He can also talk. If you can persuade him to care, Barbarister occasionally adds +2 to Presence tests involving logic and intellect. The horse may be smarter than you and is quite aware of this."
        },
        {
          "name": "Hamfund the Squire",
          "description": "This intensely cowardly servant acts only as guardian for the scabbard of the cursed sword Eurekia. Once per combat, if Ham can be found, Eurekia may be drawn. The sword does 2d6 damage, and for every swing of Eurekia roll a d6. On a 1 the squire is slain and Eurekia vanishes forever."
        },
        {
          "name": "The Snake-Skin Gift",
          "description": "An expensive sandalwood box bound in snakeskin. It contains a seemingly ordinary dagger, wrapped in silk. The dagger does d4 damage but on a 1 the target dies immediately of deadly poison weeping from the blade."
        },
        {
          "name": "Horn of the Schleswig Lords",
          "description": "Once per day release a blare from this dented old trumpet and test Presence DR12. One creature may make their next non-combat test an automatic success."
        }
      ],
      "limitations": ["Painfully average: No ability adjustments. Roll d8 on weapons table. Roll d4 on armor table but reroll if you receive heavy armor."]
    },
    {
      "id": "heretical-priest",
      "name": "Heretical Priest",
      "description": "Hunted by the two-headed basilisks of the One True Faith, this heretic can be found raving in ruins, traipsing endlessly down dusty roads and desecrating cathedrals by night.",
      "abilityRolls": {
        "strength": "3d6-2",
        "agility": "3d6",
        "presence": "3d6+2",
        "toughness": "3d6"
      },
      "hitDie": "d8",
      "startingOmens": "d4",
      "startingSilver": "3d6*10",
      "specialAbilities": [
        {
          "name": "Sacred Shepherd's Crook",
          "description": "Its head a hook of human bone inscribed with overlapping anti-prayers. This crook hooks through other worlds. Staff does 2d4 damage except to faithless humans."
        },
        {
          "name": "Stolen Mitre",
          "description": "While wearing this holy hat the priest's vile body fades, becoming hard to hit in combat (Defence DR10). If pulled over the ears outside of battle the priest becomes nearly invisible, testing stealth against DR8."
        },
        {
          "name": "List of Sins",
          "description": "A long and accurate document cross-referenced against reality to discover unseen evil-doers. Successful Presence DR10: A strange light surrounds evil creatures. The list's owner defends with +2 against any being discovered this way."
        },
        {
          "name": "The Blasphemous Nechrubel Bible",
          "description": "So intensely blasphemous even the Priests themselves can only peruse it once per day. When read, roll a die. Even result: For the rest of the day PCs heal d4 hp after just five minutes of rest. Odd result: The priest is plagued by demonic hallucinations. The DM may invent d3 things that only the Priest can see and describe them to the player as if true. This effect ends with sunrise."
        },
        {
          "name": "Stones Taken from Thel-Emas' Lost Temple",
          "description": "Cast the stones on the ground. Their pattern reveals if danger lurks in an adjacent room. The stones can lie. The priest tests Presence DR10 to see if they are true but after failing they cannot test again until the sun has set."
        },
        {
          "name": "666 (Wrong Jesus) Crucifix",
          "description": "The crucifix can be used in encounters with the undead as well as lesser trolls and goblins. Check morale (add or subtract the priest's Presence modifier) to see if the creatures bow and kindly remove themselves."
        }
      ],
      "passiveAbilities": [
        {
          "name": "Power User",
          "description": "Roll d8 on the weapons table and may use Powers while wearing medium armor."
        }
      ],
      "limitations": ["Frail: -2 Strength already applied", "Insightful: +2 Presence already applied"]
    },
    {
      "id": "occult-herbmaster",
      "name": "Occult Herbmaster",
      "description": "Born of the mushroom, raised in the glade, watched by the eye of the moon in a silverblack pool.",
      "abilityRolls": {
        "strength": "3d6-2",
        "agility": "3d6",
        "presence": "3d6",
        "toughness": "3d6+2"
      },
      "hitDie": "d6",
      "startingOmens": "d2",
      "startingSilver": "2d6*10",
      "specialAbilities": [
        {
          "name": "Red Poison",
          "description": "Toughness DR12 or -d10 hp."
        },
        {
          "name": "Ezumiel's Vapor",
          "description": "Pass a DR14 test or severe (and arguably fun) hallucinations for d4 hours."
        },
        {
          "name": "Southern Frog Stew",
          "description": "Vomit for d4 hours, pass a DR14 test or you can do nothing else."
        },
        {
          "name": "Elixir Vitalis",
          "description": "Heals d6 hp and stops infection. Can be habit-forming."
        },
        {
          "name": "Spider-Owl Soup",
          "description": "See in darkness, climb on walls for 30 minutes."
        },
        {
          "name": "Fernor's Philtre",
          "description": "Translucent oil, must be dabbed right into the eye. Heals infection and gives +2 on Presence tests for d4 hours."
        },
        {
          "name": "Hyphos' Enervating Snuff",
          "description": "Berserk! Two attacks per round but defend with DR14. Lasts one fight. Must be snorted, causes sneezing."
        },
        {
          "name": "Black Poison",
          "description": "Toughness DR14 or -d6 hp and blinded for one hour."
        }
      ],
      "passiveAbilities": [
        {
          "name": "Portable Laboratory",
          "description": "You carry a portable laboratory and continually search for frequently expended ingredients. Daily you have the materials to create two randomly determined decoctions and can brew a total of d4 doses. If unused they lose vitality after 24 hours."
        }
      ],
      "limitations": ["Low in protein: -2 Strength already applied", "Tough as wood: +2 Toughness already applied"]
    },
    {
      "id": "necromancer",
      "name": "Necromancer",
      "description": "Death clings to you like a shroud. The boundary between life and death is yours to command, and the dead whisper their secrets in your ear.",
      "abilityRolls": {
        "strength": "3d6",
        "agility": "3d6-2",
        "presence": "3d6+2",
        "toughness": "3d6"
      },
      "hitDie": "d6",
      "startingOmens": "d4",
      "startingSilver": "2d6*10",
      "specialAbilities": [
        {
          "name": "Empty Windlass Servants",
          "description": "You may animate any dead object with a Presence DR12 test, though there is a 50% chance you fail. Flesh, wood, etc. They defend at DR18, have no weapons but use the same stats for attack. They last 1d6 rounds or turn to dust, whichever comes first. They appear any way the same size or smaller than you and obey you."
        },
        {
          "name": "Arrow Powder",
          "description": "Once per day, if a ranged projectile has struck a creature within melee range of you, you can touch it to learn everything about that creature: their greatest fear, how they will die, their secrets, etc."
        },
        {
          "name": "Kindred Spelling Ore",
          "description": "You have developed a spell in death-cults. One spell per day may be cast from memory with no scroll needed. The power may be Sacred or Unclean. Roll randomly the first time. After each rest you may roll for a new spell for the next day."
        },
        {
          "name": "Afterimage",
          "description": "You wear the death of others as if it were body armor, redirecting damage. Activate this ability when taking damage; enemy rolls DR14 Presence test. On failure: you take 50% the damage. On success: the enemy's mental anguish causes them to take the damage instead of you."
        },
        {
          "name": "Shroud of the Nechrubel",
          "description": "Invoke the power you have studied from death cults to shroud yourself in dark energy. For the power you have studied from death, you gain +2 to all tests related to the dead, undead, or necromantic arts. Any living creature that looks upon you must test DR12 or become frightened."
        },
        {
          "name": "Death's Embrace",
          "description": "You may speak with any corpse within touch range. Ask up to 3 questions about their life, death, or what they witnessed. Roll Presence DR10 - on failure the corpse lies or speaks in riddles."
        }
      ],
      "passiveAbilities": [
        {
          "name": "Death-Touched Presence",
          "description": "All Presence tests rolled at +2."
        }
      ],
      "limitations": ["Frail: -2 Agility already applied", "Death-touched: +2 Presence already applied"]
    }
  ]
}
