{
  "version": "1.0.0",
  "name": "Mörk Borg Core Classes",
  "classes": [
    {
      "id": "classless",
      "name": "Classless",
      "description": "A wretched soul with no special training",
      "abilityRolls": {
        "strength": "3d6",
        "agility": "3d6",
        "presence": "3d6",
        "toughness": "3d6"
      },
      "hitDie": "d8",
      "startingOmens": "d2",
      "startingSilver": "2d6*10",
      "specialAbilities": []
    },
    {
      "id": "fanged-deserter",
      "name": "Fanged Deserter",
      "description": "You have thirty or so friends who never let you down: YOUR TEETH. Disloyal, deranged or simply uncontrollable, any group that didn't boot you out you left anyway. But your parliament of teeth—enormous, protruding, thick and sharp—have always been your allies.",
      "abilityRolls": {
        "strength": "3d6+2",
        "agility": "3d6-1",
        "presence": "3d6-1",
        "toughness": "3d6"
      },
      "hitDie": "d10",
      "startingOmens": "d2",
      "startingSilver": "2d6*10",
      "specialAbilities": [
        {
          "name": "Crumpled Monster Mask",
          "description": "Strikes primitive fear into lesser creatures like goblins, gnoums and children. While worn, they check Morale every round."
        },
        {
          "name": "The Brown Scimitar of Galgenbeck",
          "description": "A stinking sword you pulled from a military shit-ditch. D6 damage. DR10 attack and defence while you wield it. 1 in 6 chance a wounded enemy is smitten with potent sepsis, dying in 10 minutes."
        },
        {
          "name": "Wizard Teeth",
          "description": "Four weird teeth rattle within a blackened pouch. Before battle roll a d6 for each one. For every 6 one of your attacks deals maximum damage."
        },
        {
          "name": "Old Sigûrd's Sling",
          "description": "Sigûrd was the strongest man whose throat you ever gnawed. Woven from his long grey hair, this sling has never failed you. 2d4 damage, requires fist-sized rocks which, perhaps regrettably, are everywhere."
        },
        {
          "name": "Ancient Gore-Hound",
          "description": "Asthmatic, deluded and on its last legs, this wizened creature still has a superb nose and can sniffle up treasure in the most disgusting debris. Attacks with DR10 (bite d6). Defends with DR12, 10 hp. Becomes frenzied around goblins and berserkers."
        },
        {
          "name": "The Shoe of Death's Horse",
          "description": "It looks normal but since finding it in an obscure crypt you are convinced this shoe came from the horse of Death himself. In your hands it hits with DR10, d4 damage. 1 in 6 chance the shoe smashes the skull, instantly killing small-to-medium sized creatures. The shoe returns to your hand like a boomerang."
        }
      ],
      "passiveAbilities": [
        {
          "name": "Bite Attack",
          "description": "DR10 to attack, d6 damage. You must be close to your target. 1-2 on d6 chance the enemy gets a free attack."
        }
      ],
      "limitations": ["Illiterate", "Normal Agility tests are DR14 instead of DR12 (excluding defence)"]
    }
  ]
}
